FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libboard_samv7-ek/include/ili9488_reg.h
/**
 * \file
 *
 * \brief IL9488 display controller register and bitfield definitions
 *
 * Copyright (c) 2014 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */
#ifndef ILI9488_REG_H_INCLUDED
#define ILI9488_REG_H_INCLUDED

/* Level 1 Commands (from the display Datasheet) */
#define ILI9488_CMD_NOP                               0x00
#define ILI9488_CMD_SOFTWARE_RESET                    0x01
#define ILI9488_CMD_READ_DISP_ID                      0x04
#define ILI9488_CMD_READ_ERROR_DSI                    0x05
#define ILI9488_CMD_READ_DISP_STATUS                  0x09
#define ILI9488_CMD_READ_DISP_POWER_MODE              0x0A
#define ILI9488_CMD_READ_DISP_MADCTRL                 0x0B
#define ILI9488_CMD_READ_DISP_PIXEL_FORMAT            0x0C
#define ILI9488_CMD_READ_DISP_IMAGE_MODE              0x0D
#define ILI9488_CMD_READ_DISP_SIGNAL_MODE             0x0E
#define ILI9488_CMD_READ_DISP_SELF_DIAGNOSTIC         0x0F
#define ILI9488_CMD_ENTER_SLEEP_MODE                  0x10
#define ILI9488_CMD_SLEEP_OUT                         0x11
#define ILI9488_CMD_PARTIAL_MODE_ON                   0x12
#define ILI9488_CMD_NORMAL_DISP_MODE_ON               0x13
#define ILI9488_CMD_DISP_INVERSION_OFF                0x20
#define ILI9488_CMD_DISP_INVERSION_ON                 0x21
#define ILI9488_CMD_PIXEL_OFF                         0x22
#define ILI9488_CMD_PIXEL_ON                          0x23
#define ILI9488_CMD_DISPLAY_OFF                       0x28
#define ILI9488_CMD_DISPLAY_ON                        0x29
#define ILI9488_CMD_COLUMN_ADDRESS_SET                0x2A
#define ILI9488_CMD_PAGE_ADDRESS_SET                  0x2B
#define ILI9488_CMD_MEMORY_WRITE                      0x2C
#define ILI9488_CMD_MEMORY_READ                       0x2E
#define ILI9488_CMD_PARTIAL_AREA                      0x30
#define ILI9488_CMD_VERT_SCROLL_DEFINITION            0x33
#define ILI9488_CMD_TEARING_EFFECT_LINE_OFF           0x34
#define ILI9488_CMD_TEARING_EFFECT_LINE_ON            0x35
#define ILI9488_CMD_MEMORY_ACCESS_CONTROL             0x36
#define ILI9488_CMD_VERT_SCROLL_START_ADDRESS         0x37
#define ILI9488_CMD_IDLE_MODE_OFF                     0x38
#define ILI9488_CMD_IDLE_MODE_ON                      0x39
#define ILI9488_CMD_COLMOD_PIXEL_FORMAT_SET           0x3A
#define ILI9488_CMD_WRITE_MEMORY_CONTINUE             0x3C
#define ILI9488_CMD_READ_MEMORY_CONTINUE              0x3E
#define ILI9488_CMD_SET_TEAR_SCANLINE                 0x44
#define ILI9488_CMD_GET_SCANLINE                      0x45
#define ILI9488_CMD_WRITE_DISPLAY_BRIGHTNESS          0x51
#define ILI9488_CMD_READ_DISPLAY_BRIGHTNESS           0x52
#define ILI9488_CMD_WRITE_CTRL_DISPLAY                0x53
#define ILI9488_CMD_READ_CTRL_DISPLAY                 0x54
#define ILI9488_CMD_WRITE_CONTENT_ADAPT_BRIGHTNESS    0x55
#define ILI9488_CMD_READ_CONTENT_ADAPT_BRIGHTNESS     0x56
#define ILI9488_CMD_WRITE_MIN_CAB_LEVEL               0x5E
#define ILI9488_CMD_READ_MIN_CAB_LEVEL                0x5F
#define ILI9488_CMD_READ_ABC_SELF_DIAG_RES            0x68
#define ILI9488_CMD_READ_ID1                          0xDA
#define ILI9488_CMD_READ_ID2                          0xDB
#define ILI9488_CMD_READ_ID3                          0xDC

/* Level 2 Commands (from the display Datasheet) */
#define ILI9488_CMD_INTERFACE_MODE_CONTROL            0xB0
#define ILI9488_CMD_FRAME_RATE_CONTROL_NORMAL         0xB1
#define ILI9488_CMD_FRAME_RATE_CONTROL_IDLE_8COLOR    0xB2
#define ILI9488_CMD_FRAME_RATE_CONTROL_PARTIAL        0xB3
#define ILI9488_CMD_DISPLAY_INVERSION_CONTROL         0xB4
#define ILI9488_CMD_BLANKING_PORCH_CONTROL            0xB5
#define ILI9488_CMD_DISPLAY_FUNCTION_CONTROL          0xB6
#define ILI9488_CMD_ENTRY_MODE_SET                    0xB7
#define ILI9488_CMD_BACKLIGHT_CONTROL_1               0xB9
#define ILI9488_CMD_BACKLIGHT_CONTROL_2               0xBA
#define ILI9488_CMD_HS_LANES_CONTROL                  0xBE
#define ILI9488_CMD_POWER_CONTROL_1                   0xC0
#define ILI9488_CMD_POWER_CONTROL_2                   0xC1
#define ILI9488_CMD_POWER_CONTROL_NORMAL_3            0xC2
#define ILI9488_CMD_POWER_CONTROL_IDEL_4              0xC3
#define ILI9488_CMD_POWER_CONTROL_PARTIAL_5           0xC4
#define ILI9488_CMD_VCOM_CONTROL_1                    0xC5
#define ILI9488_CMD_CABC_CONTROL_1                    0xC6
#define ILI9488_CMD_CABC_CONTROL_2                    0xC8
#define ILI9488_CMD_CABC_CONTROL_3                    0xC9
#define ILI9488_CMD_CABC_CONTROL_4                    0xCA
#define ILI9488_CMD_CABC_CONTROL_5                    0xCB
#define ILI9488_CMD_CABC_CONTROL_6                    0xCC
#define ILI9488_CMD_CABC_CONTROL_7                    0xCD
#define ILI9488_CMD_CABC_CONTROL_8                    0xCE
#define ILI9488_CMD_CABC_CONTROL_9                    0xCF
#define ILI9488_CMD_NVMEM_WRITE                       0xD0
#define ILI9488_CMD_NVMEM_PROTECTION_KEY              0xD1
#define ILI9488_CMD_NVMEM_STATUS_READ                 0xD2
#define ILI9488_CMD_READ_ID4                          0xD3
#define ILI9488_CMD_ADJUST_CONTROL_1                  0xD7
#define ILI9488_CMD_READ_ID_VERSION                   0xD8
#define ILI9488_CMD_POSITIVE_GAMMA_CORRECTION         0xE0
#define ILI9488_CMD_NEGATIVE_GAMMA_CORRECTION         0xE1
#define ILI9488_CMD_DIGITAL_GAMMA_CONTROL_1           0xE2
#define ILI9488_CMD_DIGITAL_GAMMA_CONTROL_2           0xE3
#define ILI9488_CMD_SET_IMAGE_FUNCTION                0xE9
#define ILI9488_CMD_ADJUST_CONTROL_2                  0xF2
#define ILI9488_CMD_ADJUST_CONTROL_3                  0xF7
#define ILI9488_CMD_ADJUST_CONTROL_4                  0xF8
#define ILI9488_CMD_ADJUST_CONTROL_5                  0xF9
#define ILI9488_CMD_SPI_READ_SETTINGS                 0xFB
#define ILI9488_CMD_ADJUST_CONTROL_6                  0xFC
#define ILI9488_CMD_ADJUST_CONTROL_7                  0xFF

#endif /* ILI9488_REGS_H_INCLUDED */
